mahdidadashi65/STM32_IOT_RTOS_MECO1/STM32_IOT_RTOS_CODE/Test2/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define NRF_CE_Pin GPIO_PIN_1
#define NRF_CE_GPIO_Port GPIOC
#define NRF_CSN_Pin GPIO_PIN_2
#define NRF_CSN_GPIO_Port GPIOC
#define NRF_IRQ_Pin GPIO_PIN_3
#define NRF_IRQ_GPIO_Port GPIOC
#define NRF_IRQ_EXTI_IRQn EXTI3_IRQn
#define SD_CS_Pin GPIO_PIN_4
#define SD_CS_GPIO_Port GPIOA
#define SD_DET_Pin GPIO_PIN_4
#define SD_DET_GPIO_Port GPIOC
#define LED_B_Pin GPIO_PIN_7
#define LED_B_GPIO_Port GPIOE
#define LED_R_Pin GPIO_PIN_8
#define LED_R_GPIO_Port GPIOE
#define LED_G_Pin GPIO_PIN_9
#define LED_G_GPIO_Port GPIOE
#define TM1638_DIO_Pin GPIO_PIN_10
#define TM1638_DIO_GPIO_Port GPIOE
#define TM1638_CLK_Pin GPIO_PIN_11
#define TM1638_CLK_GPIO_Port GPIOE
#define TM1638_STB_Pin GPIO_PIN_12
#define TM1638_STB_GPIO_Port GPIOE
#define W25Q_CS_Pin GPIO_PIN_15
#define W25Q_CS_GPIO_Port GPIOB
#define WIZ_RST_Pin GPIO_PIN_15
#define WIZ_RST_GPIO_Port GPIOD
#define WIZ_IRQ_Pin GPIO_PIN_8
#define WIZ_IRQ_GPIO_Port GPIOC
#define WIZ_CS_Pin GPIO_PIN_9
#define WIZ_CS_GPIO_Port GPIOC
#define ST7789_RST_Pin GPIO_PIN_2
#define ST7789_RST_GPIO_Port GPIOD
#define ST7789_DC_Pin GPIO_PIN_3
#define ST7789_DC_GPIO_Port GPIOD
#define ST7789_CS_Pin GPIO_PIN_4
#define ST7789_CS_GPIO_Port GPIOD
#define RS485_DIR_Pin GPIO_PIN_7
#define RS485_DIR_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
